<?php

/**
 * --------------------------------------------------------------------------------------------------------------------
 * MST theo tỉnh, sắp xếp tăng dần theo độ lớn chuỗi số
 * --------------------------------------------------------------------------------------------------------------------
 * 010: Hà Nội
 * 020: Hải Phòng
 * 031: TP Hồ Chí Minh
 * 040: Đà Nẵng
 * 060: Nam Định
 * 070: Hà Nam
 * 080: Hải Dương
 * 090: Hưng Yên
 * 100: Thái Bình
 * 110: Long An
 * 120: Tiền Giang
 * 130: Bến Tre
 * 140: Đồng Tháp
 * 150: Vĩnh Long
 * 160: An Giang
 * 170: Kiên Giang
 * 180: Cần Thơ
 * 190: Bạc Liêu
 * 200: Cà Mau
 * 210: Trà Vinh
 * 220: Sóc Trăng
 * 230: Bắc Ninh
 * 240: Bắc Giang
 * 250: Vĩnh Phúc
 * 260: Phú Thọ
 * 270: Ninh Bình
 * 280: Thanh Hoá
 * 290: Nghệ An
 * 300: Hà Tĩnh
 * 310: Quảng Bình
 * 320: Quảng Trị
 * 330: Thừa Thiên - Huế
 * 340: Bình Thuận
 * 350: Bà Rịa - Vũng Tàu
 * 360: Đồng Nai
 * 370: Bình Dương
 * 380: Bình Phước
 * 390: Tây Ninh
 * 400: Quảng Nam
 * 410: Bình Định
 * 420: Khánh Hòa
 * 430: Quảng Ngãi
 * 440: Phú Yên
 * 450: Ninh Thuận
 * 460: Thái Nguyên
 * 470: Bắc Kạn
 * 480: Cao Bằng
 * 490: Lạng Sơn
 * 500: Tuyên Quang
 * 510: Hà Giang
 * 520: Yên Bái
 * 530: Lào Cai
 * 540: Hòa Bình
 * 550: Sơn La
 * 560: Điện Biên
 * 570: Quảng Ninh
 * 580: Lâm Đồng
 * 590: Gia Lai
 * 600: Đắc Lắc
 * 610: Kon Tum
 * 620: Lai Châu
 * 630: Hậu Giang
 * 640: Đắk Nông
 * --------------------------------------------------------------------------------------------------------------------
 */
return [
    'tax_code_by_province' => [
        '010', '020', '031', '040', '060', '070', '080', '090',
        '100', '110', '120', '130', '140', '150', '160', '170', '180', '190',
        '200', '210', '220', '230', '240', '250', '260', '270', '280', '290',
        '300', '310', '320', '330', '340', '350', '360', '370', '380', '390',
        '400', '410', '420', '430', '440', '450', '460', '470', '480', '490',
        '500', '510', '520', '530', '540', '550', '560', '570', '580', '590',
        '600', '610', '620', '630', '640'
    ],

    'landline_by_province' => [
        '0203', '0204', '0205', '0206', '0207', '0208', '0209', '0210', '0211', '0212',
        '0213', '0214', '0215', '0216', '0218', '0219', '0220', '0221', '0222', '0225',
        '0226', '0227', '0228', '0229', '0232', '0233', '0234', '0235', '0236', '0237',
        '0238', '0239', '024', '0251', '0252', '0254', '0255', '0256', '0257', '0258',
        '0259', '0260', '0261', '0262', '0263', '0269', '0270', '0271', '0272', '0273',
        '0274', '0275', '0276', '0277', '028', '0290', '0291', '0292', '0293', '0294',
        '0296', '0297', '0299'
    ],

    'prefix_by_network' => [

    ],

    'blacklist_password' => [
        '111111a@','111111A@','111111@a','111111@A',
        '123456a@','123456A@','123456@a','123456@A',
        'admin@123','admin@1234','admin@2010','admin@2011','admin@2012','admin@2013','admin@2014','admin@2015','admin@2016','admin@2017',
        'Admin@123','Admin@1234','Admin@2010','Admin@2011','Admin@2012','Admin@2013','Admin@2014','Admin@2015','Admin@2016','Admin@2017',
        'viettel@123','viettel@1234','viettel@2010','viettel@2011','viettel@2012','viettel@2013','viettel@2014','viettel@2015','viettel@2016','viettel@2017',
        'Viettel@123','Viettel@1234','Viettel@2010','Viettel@2011','Viettel@2012','Viettel@2013','Viettel@2014','Viettel@2015','Viettel@2016','Viettel@2017',
        'password@123','password@1234','password@2010','password@2011','password@2012','password@2013','password@2014','password@2015','password@2016','password@2017',
        'Password@123','Password@1234','Password@2010','Password@2011','Password@2012','Password@2013','Password@2014','Password@2015','Password@2016','Password@2017',
        'passw0rda@','passw0rdA@','passw0rd@123','passw0rd@1234','passw0rd@2010','passw0rd@2011','passw0rd@2012','passw0rd@2013','passw0rd@2014','passw0rd@2015','passw0rd@2016','passw0rd@2017',
        'passw0rd@a','passw0rd@A',
        'qwerty@123','qwerty@1234','qwerty@2010','qwerty@2011','qwerty@2012','qwerty@2013','qwerty@2014','qwerty@2015','qwerty@2016','qwerty@2017',
        'abc123a@','abc123A@','abc123@123','abc123@1234','abc123@2010','abc123@2011','abc123@2012','abc123@2013','abc123@2014','abc123@2015','abc123@2016','abc123@2017',
        'abc123@a','abc123@A',
        '123123a@','123123A@','123123@a','123123@A',
        'root@123','root@1234','root@2010','root@2011','root@2012','root@2013','root@2014','root@2015','root@2016','root@2017',
        'Root@123','Root@1234','Root@2010','Root@2011','Root@2012','Root@2013','Root@2014','Root@2015','Root@2016','Root@2017',
        'r00t@123','r00t@1234','r00t@2010','r00t@2011','r00t@2012','r00t@2013','r00t@2014','r00t@2015','r00t@2016','r00t@2017',
        'R00t@123','R00t@1234','R00t@2010','R00t@2011','R00t@2012','R00t@2013','R00t@2014','R00t@2015','R00t@2016','R00t@2017',
        'qazwsx@123','qazwsx@1234','qazwsx@2010','qazwsx@2011','qazwsx@2012','qazwsx@2013','qazwsx@2014','qazwsx@2015','qazwsx@2016','qazwsx@2017',
        '123qwea@','123qweA@','123qwe@123','123qwe@1234','123qwe@2010','123qwe@2011','123qwe@2012','123qwe@2013','123qwe@2014','123qwe@2015','123qwe@2016','123qwe@2017','123qwe@a','123qwe@A',
        '123456a@A','123456aA@','123456@aA','123456@Aa','123456A@a','123456Aa@',
        '135246a@A','135246aA@','135246@aA','135246@Aa','135246A@a','135246Aa@',
        '246135a@A','246135aA@','246135@aA','246135@Aa','246135A@a','246135Aa@',
        '654321a@A','654321aA@','654321@aA','654321@Aa','654321A@a','654321Aa@',
        '642531a@A','642531aA@','642531@aA','642531@Aa','642531A@a','642531Aa@',
        '531642a@A','531642aA@','531642@aA','531642@Aa','531642A@a','531642Aa@',
        '123457a@A','123457aA@','123457@aA','123457@Aa','123457A@a','123457Aa@',
        '123@123a',
        '12345678','123456789','1234567890'
    ]
];